; ===================================================================================
; 											ФУНКЦИЯ УДАЛЕНИЯ ЛИШНИХ СИМВОЛОВ ИЗ ПУТЕЙ
; ===================================================================================
TrimPath(GivenPath)
{
	GivenPath := StrReplace(GivenPath, """", "") ; Удаление кавычек из пути
	GivenPath := RegExReplace(GivenPath, "[\\+]$", "", ,1) ; Удаление замыкающего слэша из пути
	GivenPath := RegExReplace(GivenPath, "^[\\+]", "", ,1) ; Удаление предшествующего слэша из пути
	Return %GivenPath%
}
